str1 = """
千山鸟飞绝
万尽人踪灭
孤舟梭立翁
独钓寒江雪
"""

"""
案例展示用 python 实现古诗词横竖两种版本效果图

实现横向打印效果如下
千山鸟飞绝
万尽人踪灭
孤舟梭立翁
独钓寒江雪

实现竖向打印效果如下
千万孤独
山尽舟钓
鸟人梭寒
飞踪立江
绝灭翁雪
"""

arr = [
    ['千', '山', '鸟', '飞', '绝'],
    ['万', '尽', '人', '踪', '灭'],
    ['孤', '舟', '梭', '立', '翁'],
    ['独', '钓', '寒', '江', '雪']
]

for row in range(len(arr)):  # 行

    for col in range(len(arr[1])):  # 列
        print(arr[col][row], end='\t')

    print()


#  代码尽量一行不要写过多的逻辑
# 函数调用, 引用...  代码的可读性
print('================================')
for col in range(len(arr[0])):   # 取列数索引
    for row in range(len(arr)):
        print(arr[row][col], end='\t')
    print()




