"""
作业1：
有N个人要参加会议，现在需要安排座位。
请用python实现将N个人安排座位
"""
name = """
邓永明    廖德超    张勇 杨久林    戴贵富    秦代坤    李元东 田显余
"""

# 有多少个人
name_list = name.split()

# 2. 办公室名字
site_list = ['1号办公室1位置', '1号办公室2位置', '1号办公室3位置',
             '2号办公室1位置', '2号办公室2位置', '2号办公室3位置',
             '3号办公室1位置', '3号办公室2位置']
# print(site_list)

# 答案存放的位置
content = []

# 答案以二维列表输出 [('1号办公室1位置', '秦代坤'), ('1号办公室2位置', '廖德超'),.......]
"""自己在下方编写代码实现功能"""
for i in range(len(name_list)):
    content.append((site_list[i], name_list[i]))

print(content)
